package neo;

import java.io.PrintStream;
import org.lwjgl.opengl.GL20;

public class 0er implements 0cD, 0eq {
   public final int field_a;
   private static String _ _;

   private static int method_bJN(0er var0) {
      return var0.field_a;
   }

   // $FF: synthetic method
   // $FF: bridge method
   private static String method_bJM(String var0) {
      StringBuilder var1 = new StringBuilder();

      for(int var2 = 30451 ^ -8292 ^ 2482 ^ -24355; var2 < var0.length(); ++var2) {
         var1.append((char)(var0.charAt(var2) ^ 7060 ^ -32347 ^ 6575 ^ -30908));
      }

      return var1.toString();
   }

   private static int method_bJO(0er var0) {
      return var0.field_a;
   }

   public _er/* $FF was: 0er*/(String d) {
      int e = GL20.glCreateProgram();
      int var5 = -11576 ^ -6153 ^ 26677 ^ -23819;
      switch (d.hashCode()) {
         case -1459827354:
            if (d.equals(method_bJM("ҵүҮҶҳҴҿҾ҈ҿҹҮ"))) {
               var5 = 14409 ^ -15946 ^ 11477 ^ -10965;
            }
            break;
         case -72859087:
            if (d.equals(method_bJM("ҨҵүҴҾҿҾ҈ҿҹҮ"))) {
               var5 = 32215 ^ -27102 ^ 5458 ^ -345;
            }
            break;
         case 491760948:
            if (d.equals(method_bJM("ҽҨһҾҳҿҴҮ҈ҿҹҮ"))) {
               var5 = 16156 ^ -21412 ^ 18898 ^ -9584;
            }
      }

      int f;
      switch (var5) {
         case 0:
            f = this.method_bJL(method_bJM("ӹҬҿҨҩҳҵҴӺӫӨӪӐӐүҴҳҼҵҨҷӺҬҿҹӨӺҶҵҹһҮҳҵҴӶӺҨҿҹҮ҉ҳҠҿӡӐүҴҳҼҵҨҷӺҬҿҹӮӺҹҵҶҵҨӡӐүҴҳҼҵҨҷӺҼҶҵһҮӺҨһҾҳүҩӡӐүҴҳҼҵҨҷӺҸҵҵҶӺҸҶүҨӡӐӐҼҶҵһҮӺҨҵүҴҾ҉ҞҜӲҬҿҹӨӺҪӶӺҬҿҹӨӺҸӶӺҼҶҵһҮӺҨӳӺҡӐӺӺӺӺҨҿҮүҨҴӺҶҿҴҽҮҲӲҷһҢӲһҸҩӲҪӳӺӷӺҸӶӺӪӴӪӳӳӺӷӺҨӡӐҧӐӐӐҬҵҳҾӺҷһҳҴӲӳӺҡӐӺӺӺӺҬҿҹӨӺҨҿҹҮҒһҶҼӺӧӺҨҿҹҮ҉ҳҠҿӺӰӺӴӯӡӐӺӺӺӺӵӵӺ҉ҷҵҵҮҲӺҮҲҿӺҨҿҩүҶҮӺӲҼҨҿҿӺһҴҮҳһҶҳһҩҳҴҽӳӴӐӺӺӺӺҼҶҵһҮӺҩҷҵҵҮҲҿҾқҶҪҲһӺӧӺӺӲӫӴӪӷҩҷҵҵҮҲҩҮҿҪӲӪӴӪӶӺӫӴӪӶӺҨҵүҴҾ҉ҞҜӲҨҿҹҮҒһҶҼӺӷӺӲҽҶ҅ҎҿҢҙҵҵҨҾҁӪ҇ӴҩҮӺӰӺҨҿҹҮ҉ҳҠҿӳӶӺҨҿҹҮҒһҶҼӺӷӺҨһҾҳүҩӺӷӺӫӴӶӺҨһҾҳүҩӳӳӳӺӰӺҹҵҶҵҨӴһӡӐӺӺӺӺҽҶ҅ҜҨһҽҙҵҶҵҨӺӧӺҬҿҹӮӲҹҵҶҵҨӴҨҽҸӶӺҩҷҵҵҮҲҿҾқҶҪҲһӳӡӵӵӺҷҳҢӲҫүһҾҙҵҶҵҨӶӺҩҲһҾҵҭҙҵҶҵҨӶӺӪӴӪӳӡӐӐҧ"), 99103 ^ 'ꩥ' ^ 117922 ^ 28392);
            break;
         case 1:
            f = this.method_bJL(method_bJM("ӹҬҿҨҩҳҵҴӺӫӨӪӐӐүҴҳҼҵҨҷӺҬҿҹӨӺҶҵҹһҮҳҵҴӶӺҩҳҠҿӡӐүҴҳҼҵҨҷӺҬҿҹӮӺҹҵҶҵҨӶӺҵүҮҶҳҴҿҙҵҶҵҨӡӐүҴҳҼҵҨҷӺҼҶҵһҮӺҨһҾҳүҩӶӺҮҲҳҹұҴҿҩҩӡӐӐҼҶҵһҮӺҨҵүҴҾҿҾӲҬҿҹӨӺҹҿҴҮҿҨҊҵҩӶӺҬҿҹӨӺҩҳҠҿӶӺҼҶҵһҮӺҨһҾҳүҩӳӺҡӐӺӺӺӺҨҿҮүҨҴӺҶҿҴҽҮҲӲҷһҢӲһҸҩӲҹҿҴҮҿҨҊҵҩӳӺӷӺҩҳҠҿӺӱӺҨһҾҳүҩӶӺӪӴӪӳӳӺӷӺҨһҾҳүҩӡӐҧӐӐҬҵҳҾӺҷһҳҴӲӳӐҡӐӺӺӺӺҼҶҵһҮӺҨ҉ҞҜӺӧӺҨҵүҴҾҿҾӲҽҶ҅ҜҨһҽҙҵҵҨҾӴҢңӺӷӺҶҵҹһҮҳҵҴӺӷӺӲҩҳҠҿӵӨӳӶӺӲҩҳҠҿӵӨӳӺӱӺӲҮҲҳҹұҴҿҩҩӵӨӳӺӷӺӫӴӪӶӺҨһҾҳүҩӳӡӐӐӺӺӺӺҼҶҵһҮӺҸҶҿҴҾқҷҵүҴҮӺӧӺҩҷҵҵҮҲҩҮҿҪӲӪӴӪӶӺӨӴӪӶӺһҸҩӲҨ҉ҞҜӳӺӷӺӲҮҲҳҹұҴҿҩҩӵӨӳӳӡӐӐӺӺӺӺҬҿҹӮӺҳҴҩҳҾҿҙҵҶҵҨӺӧӺӲҨ҉ҞҜӺӦӺӪӴӪӳӺӥӺҹҵҶҵҨӺӠӺҬҿҹӮӲҵүҮҶҳҴҿҙҵҶҵҨӴҨҽҸӶӺӺӪӴӪӳӡӐӐӺӺӺӺҽҶ҅ҜҨһҽҙҵҶҵҨӺӧӺҷҳҢӲҵүҮҶҳҴҿҙҵҶҵҨӶӺҳҴҩҳҾҿҙҵҶҵҨӶӺҸҶҿҴҾқҷҵүҴҮӳӡӐҧ"), 31286 ^ '횟' ^ 3300 ^ 11133);
            break;
         case 2:
            f = this.method_bJL(method_bJM("ӹҬҿҨҩҳҵҴӺӫӨӪӐӐүҴҳҼҵҨҷӺҬҿҹӨӺҶҵҹһҮҳҵҴӶӺҨҿҹҮ҉ҳҠҿӡӐүҴҳҼҵҨҷӺҬҿҹӮӺҹҵҶҵҨӫӶӺҹҵҶҵҨӨӶӺҹҵҶҵҨөӶӺҹҵҶҵҨӮӡӐүҴҳҼҵҨҷӺҼҶҵһҮӺҨһҾҳүҩӡӐӐӹҾҿҼҳҴҿӺҔҕғ҉ҟӺӴӯӵӨӯӯӴӪӐӐҼҶҵһҮӺҨҵүҴҾ҉ҞҜӲҬҿҹӨӺҪӶӺҬҿҹӨӺҸӶӺҼҶҵһҮӺҨӳӺҡӐӺӺӺӺҨҿҮүҨҴӺҶҿҴҽҮҲӲҷһҢӲһҸҩӲҪӳӺӷӺҸӺӶӺӪӴӪӳӳӺӷӺҨӡӐҧӐӐҬҿҹөӺҹҨҿһҮҿҝҨһҾҳҿҴҮӲҬҿҹӨӺҹҵҵҨҾҩӶӺҬҿҹөӺҹҵҶҵҨӫӶӺҬҿҹөӺҹҵҶҵҨӨӶӺҬҿҹөӺҹҵҶҵҨөӶӺҬҿҹөӺҹҵҶҵҨӮӳҡӐӺӺӺӺҬҿҹөӺҹҵҶҵҨӺӧӺҷҳҢӲҷҳҢӲҹҵҶҵҨӫӴҨҽҸӶӺҹҵҶҵҨӨӴҨҽҸӶӺҹҵҵҨҾҩӴңӳӶӺҷҳҢӲҹҵҶҵҨөӴҨҽҸӶӺҹҵҶҵҨӮӴҨҽҸӶӺҹҵҵҨҾҩӴңӳӶӺҹҵҵҨҾҩӴҢӳӡӐӺӺӺӺӵӵҞҳҮҲҿҨҳҴҽӺҮҲҿӺҹҵҶҵҨӐӺӺӺӺӵӵӺҼҨҵҷӺҲҮҮҪҩӠӵӵҩҲһҾҿҨӷҮүҮҵҨҳһҶӴҾҿҬӵһҾҬһҴҹҿҾӵҹҵҶҵҨӷҸһҴҾҳҴҽӷҾҳҮҲҿҨҳҴҽӵӐӺӺӺӺҹҵҶҵҨӺӱӧӺҷҳҢӲҔҕғ҉ҟӶӺӷҔҕғ҉ҟӶӺҼҨһҹҮӲҩҳҴӲҾҵҮӲҹҵҵҨҾҩӴҢңӶӺҬҿҹӨӲӫӨӴӣӢӣӢӶӺӭӢӴӨөөӳӳӳӺӰӺӮөӭӯӢӴӯӮӯөӳӳӡӐӺӺӺӺҨҿҮүҨҴӺҹҵҶҵҨӡӐҧӐӐҬҵҳҾӺҷһҳҴӲӳӺҡӐӺӺӺӺҬҿҹӨӺҩҮӺӧӺҽҶ҅ҎҿҢҙҵҵҨҾҁӪ҇ӴҩҮӡӐӺӺӺӺҬҿҹӨӺҲһҶҼ҉ҳҠҿӺӧӺҨҿҹҮ҉ҳҠҿӺӰӺӴӯӡӐӺӺӺӺӐӺӺӺӺҼҶҵһҮӺҩҷҵҵҮҲҿҾқҶҪҲһӺӧӺӺӲӫӴӪӷҩҷҵҵҮҲҩҮҿҪӲӪӴӪӶӺӨӴӶӺҨҵүҴҾ҉ҞҜӲҲһҶҼ҉ҳҠҿӺӷӺӲҽҶ҅ҎҿҢҙҵҵҨҾҁӪ҇ӴҩҮӺӰӺҨҿҹҮ҉ҳҠҿӳӶӺҲһҶҼ҉ҳҠҿӺӷӺҨһҾҳүҩӺӷӺӫӴӶӺҨһҾҳүҩӳӳӳӺӰӺҹҵҶҵҨӫӴһӡӐӺӺӺӺҽҶ҅ҜҨһҽҙҵҶҵҨӺӧӺҬҿҹӮӲҹҨҿһҮҿҝҨһҾҳҿҴҮӲҩҮӶӺҹҵҶҵҨӫӴҨҽҸӶӺҹҵҶҵҨӨӴҨҽҸӶӺҹҵҶҵҨөӴҨҽҸӶӺҹҵҶҵҨӮӴҨҽҸӳӶӺҩҷҵҵҮҲҿҾқҶҪҲһӳӡӐҧ"), 20140 ^ '킛' ^ 9193 ^ 14062);
            break;
         default:
            String var10002 = method_bJM("ҏҴұҴҵҭҴӺ҉ҲһҾҿҨӠӺӿҩ");
            Object[] var10003 = new Object[32096 ^ -20906 ^ 2366 ^ -9719];
            var10003[12573 ^ -7558 ^ 5722 ^ -15043] = d;
            throw new IllegalStateException(String.format(var10002, var10003));
      }

      GL20.glAttachShader(e, f);
      GL20.glAttachShader(e, this.method_bJL(method_bJM("ӹҬҿҨҩҳҵҴӺӫӨӪӐӐҬҵҳҾӺҷһҳҴӲӳӺҡӐӺӺӺӺҽҶ҅ҎҿҢҙҵҵҨҾҁӪ҇ӺӧӺҽҶ҅җүҶҮҳҎҿҢҙҵҵҨҾӪӡӐӺӺӺӺҽҶ҅ҊҵҩҳҮҳҵҴӺӧӺҽҶ҅җҵҾҿҶҌҳҿҭҊҨҵҰҿҹҮҳҵҴҗһҮҨҳҢӺӰӺҽҶ҅ҌҿҨҮҿҢӡӐҧ"), 102158 ^ '軥' ^ 103677 ^ 7719));
      GL20.glLinkProgram(e);
      if (GL20.glGetProgrami(e, 19032 ^ '\uf8bc' ^ 26481 ^ 24087) == 0) {
         throw new IllegalStateException(method_bJM("҉ҲһҾҿҨӺҼһҳҶҿҾӺҮҵӺҶҳҴұӻ"));
      } else {
         this.field_a = e;
      }
   }

   private int method_bJL(String a, int b) {
      int c = GL20.glCreateShader(b);
      GL20.glShaderSource(c, a);
      GL20.glCompileShader(c);
      if (GL20.glGetShaderi(c, 23616 ^ 'ꀭ' ^ 6286 ^ 28514) == 0) {
         method_bJQ().println(GL20.glGetShaderInfoLog(c, 31844 ^ -44522 ^ '\uef0f' ^ -11907));
         String var10002 = method_bJM("҉ҲһҾҿҨӺӲӿҩӳӺҼһҳҶҿҾӺҮҵӺҹҵҷҪҳҶҿӻ");
         Object[] var10003 = new Object[31511 ^ -11069 ^ 14052 ^ -26319];
         var10003[11180 ^ -18447 ^ 14295 ^ -21622] = b;
         throw new IllegalStateException(String.format(var10002, var10003));
      } else {
         return c;
      }
   }

   private static int method_bJP(0er var0) {
      return var0.field_a;
   }

   public void method_bJI() {
      GL20.glUseProgram(22671 ^ -19628 ^ 21113 ^ -18014);
   }

   public void method_bJJ(String a, float... b) {
      int c = GL20.glGetUniformLocation(method_bJO(this), a);
      switch (b.length) {
         case 1:
            GL20.glUniform1f(c, b[31299 ^ -13605 ^ 31360 ^ -13800]);
            break;
         case 2:
            GL20.glUniform2f(c, b[29160 ^ -5166 ^ 19243 ^ -12015], b[1019 ^ -19844 ^ 10653 ^ -26597]);
            break;
         case 3:
            GL20.glUniform3f(c, b[19435 ^ -14753 ^ 28501 ^ -7455], b[16995 ^ -6996 ^ 16503 ^ -6471], b[27443 ^ -17685 ^ 29488 ^ -23830]);
            break;
         case 4:
            GL20.glUniform4f(c, b[29788 ^ -5939 ^ 27092 ^ -2747], b[13249 ^ -28288 ^ 9368 ^ -31016], b[22244 ^ -11230 ^ 19915 ^ -12529], b[29961 ^ -23467 ^ 13261 ^ -7534]);
      }

   }

   public void method_bJH() {
      GL20.glUseProgram(method_bJN(this));
   }

   public void method_bJK(String a, int... b) {
      int c = GL20.glGetUniformLocation(method_bJP(this), a);
      if (b.length > (5041 ^ -30744 ^ 24829 ^ -2907)) {
         GL20.glUniform2i(c, b[13965 ^ -1701 ^ 259 ^ -12587], b[16204 ^ -19114 ^ 19358 ^ -15995]);
      } else {
         GL20.glUniform1i(c, b[22398 ^ -653 ^ 27436 ^ -16095]);
      }

   }

   private static PrintStream method_bJQ() {
      return System.out;
   }
}
